import { useState } from 'react'



function App() {



  // კაუჭი არის React-ის ფუნქცია, რომელიც ფუნქციურ კომპონენტს დამატებით შესაძლებლობებს აძლევს.
// კაუჭი შექმნეს იმისთვის, რომ class-ების გარეშე შეგვეძლოს state-ის და სხვა მექანიზმების გამოყენება.
// კაუჭს ვიყენებთ მაშინ, როცა გვჭირდება მონაცემის დამახსოვრება და კომპონენტის განახლება.
// useState არის React-ის კაუჭი, რომელიც კომპონენტის მდგომარეობას  ინახავს.
// useState-ს ვიყენებთ state-ის შესაქმნელად და მისი მნიშვნელობის შესაცვლელად ფუნქციურ კომპონენტში.


  return (
    <>

    </>
  )
}

export default App
