function App() {



//TailwindCSS არის  CSS framework.ეს ნიშნავს, რომ დიზაინი შენდება პატარა, მზა კლასების გამოყენებით.
//TailwindCSS გამოიყენება ვებსაიტების დიზაინის სწრაფად ასაგებად და  თანამედროვე  კომპონენტების შესაქმნელად
//TailwindCSS-ის დადებითი მხარეებია ნაკლები CSS კოდი და ნაკლები შეცდომა  ძალიან სწრაფი მუშაობა


//ზომები
// w-64 -> სიგანე  
// h-32 -> სიმაღლე

//ფერები:
//bg-blue-500 -> ფონის ფერი
//text-white -> ტექსტის ფერი


  return (
    <>
     
    </>
  )
}

export default App
