
# დანომრილია ცვლადები - list tuples
# შეგიძლია გამოიყენო dot notation - list
# tuples იყენებს ნაკლებ ადგილს და არის უფრო სწრაფი გამოსაყენებელი ვიდრე list
# list იყენებს [] ფრჩხილებს ხოლო tuple  იყენებს () ფრჩხილებს
# ორივეს შეუძლია დაიტიოს ბევრი ინფორმაცია ერთდროულად
# tuples არის შეუცვლელი ხოლო list არის ცვალებადი






# list არის ცვალებადი დალაგებული კოლექცია
# tuples არის შეუცვლელი  დალაგებული კოლექცია
# set არის დაულაგებელი კოლექცია
# tuple  იყენებს () ფრჩხილებს
# list იყენებს [] ფრჩხილებს
# set იყენებს {} ფრჩხილებს
# შეგიძლია გამოიყენო dot notation list და set


