




  //დღეს ჩვენ უნდა გაგვეკეთებინა საიტი  მაგრამ მარტო კომენტარები და არა მთლიანი საიტი. ამ პროექტის გაკეთებაში გამოვიყენეთ codeacademy ში ნასწავლი თემები მაგალითად: props map 
  // import/export component-ები და სხვა რეაქტის მასალა ჩემთვის ყველაფერი გასაგები იყო და ამ პროექტით გადავიმეორე ძველი მასალა როგორიცაა arrow function და map. მე ეს პროექტი მეტ-ნაკლებად გამიმარტივდა ცოტა გამიჭირდა map-ის გახსენება. გაუგებარი ჩემთვის არაფერი იყო


function App() {

  return (
    <>
      
    </>
  )
}

export default App
