//api შემოკლებული ფორმაა და ნიშნავს Application Programming Interface
//api ძალიან გვეხმარება ვებსაიტის გასაკეთებლად მისი გამოყენებით შეგვიძლია შევამციროთ კოდის რაოდენობა ათასობით და მეტით
//api არის მესენჯერი რომლის საშვალებითაც ორი პროგრამა ერთმანეს უკავშირდება და ინფრომაცია გადააქვთ
//მაგალითად როცა ამინდის მონაცემები ჭირდება პროგრამას ის სთხოვს api სერვერს მოანცემებს და api უბრუნებს იმ მონაცემებს რაც ჭირდება ამიტომ პროგრამის შემქმნელს არ მოუწია თავისი ხელით გადმოეტანა ამინდის ინფორმაცია მის პროგრამაში
//კარგი მხარეებია: მარტივი კომუნიკაცია პროგრამებს შორის, დროის დამზოგი  
//ცუდი მხარეები: არარის უფასო სანდო და განვითარებuილი api, როცა api ვიყენებთ უფრო დიდი შანსია ჰაკერული შემოტევების 